# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge of one-to-many and many-to-many relationships!

## Objectives

You will be able to:
* Explain one-to-many and many-to-many joins as well as implications for the size of query results
* Query data using one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [1]:
# Your code here
import sqlite3 
import pandas as pd

conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Employees and their Office (a One-to-One join)

Return a DataFrame with all of the employees including their first name and last name along with the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [8]:
# Your code here
df = pd.DataFrame(cur.execute('''SELECT * FROM employees JOIN offices USING (officeCode)''').fetchall())
df.columns = [i[0] for i in cur.description]
print(len(df))
df.head()

23

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle,city,phone,addressLine1,addressLine2,state,country,postalCode,territory
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,,President,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NA
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002,VP Sales,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NA
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002,VP Marketing,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NA
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056,Sales Manager (APAC),Sydney,+61 2 9264 2451,5-11 Wentworth Avenue,Floor #2,,Australia,NSW 2010,APAC
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056,Sale Manager (EMEA),Paris,+33 14 723 4404,43 Rue Jouffroy D'abbans,,,France,75017,EMEA

## Customers and their Orders (a One-to-Many join)

Return a DataFrame with all of the customer contacts (first and last names) along with details for each of the customers' order numbers, order dates, and statuses.

In [10]:
# Your code here
df = pd.DataFrame(cur.execute('''SELECT * 
                                 FROM orders 
                                 JOIN customers 
                                 USING (customerNumber)''').fetchall())
df.columns = [i[0] for i in cur.description]
print(len(df))
df.head()

326

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,Online Diecast Creations Co.,Young,Dorothy,6035558647,2304 Long Airport Avenue,,Nashua,NH,62005,USA,1216,114200
1,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128,"Blauer See Auto, Co.",Keitel,Roland,+49 69 66 90 2555,Lyonerstr. 34,,Frankfurt,,60528,Germany,1504,59700
2,10102,2003-01-10,2003-01-18,2003-01-14,Shipped,,181,Vitachrome Inc.,Frick,Michael,2125551500,2678 Kingston Rd.,Suite 101,NYC,NY,10022,USA,1286,76400
3,10103,2003-01-29,2003-02-07,2003-02-02,Shipped,,121,Baane Mini Imports,Bergulfsen,Jonas,07-98 9555,Erling Skakkes gate 78,,Stavern,,4110,Norway,1504,81700
4,10104,2003-01-31,2003-02-09,2003-02-01,Shipped,,141,Euro+ Shopping Channel,Freyre,Diego,(91) 555 94 44,"C/ Moralzarzal, 86",,Madrid,,28034,Spain,1370,227600

## Customers and their Payments (another One-to-Many join)

Return a DataFrame with all of the customer contacts (first and last names) along with details for each of the customers' payment amounts and date of payment. Sort these results in descending order by the payment amount.

In [11]:
# Your code here
df = pd.DataFrame(cur.execute('''SELECT contactFirstName, contactLastName, amount, paymentDate  
                                 FROM payments 
                                 JOIN customers 
                                 USING (customerNumber)''').fetchall())
df.columns = [i[0] for i in cur.description]
print(len(df))
df.head()

273

  contactFirstName contactLastName    amount paymentDate
0          Carine          Schmitt   6066.78  2004-10-19
1          Carine          Schmitt  14571.44  2003-06-05
2          Carine          Schmitt   1676.14  2004-12-18
3             Jean            King  14191.12  2004-12-17
4             Jean            King  32641.98  2003-06-06

## Orders, Order details, and Product Details (a Many-to-Many Join)

Return a DataFrame with all of the customer contacts (first and last names) along with the product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

> Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries that can make complex queries such as this much simpler!

In [14]:
# Your code here
df = pd.DataFrame(cur.execute('''SELECT contactFirstName, contactLastName, productName,
                                 orderDate, quantityOrdered
                                 FROM customers 
                                 JOIN Orders 
                                 USING (customerNumber)
                                 JOIN orderdetails
                                 USING (orderNumber)
                                 JOIN products
                                 USING (productCode)
                                 ORDER BY (orderDate)''').fetchall())
df.columns = [i[0] for i in cur.description]
print(len(df))
df.head()

2996

,contactFirstName,contactLastName,productName,orderDate,quantityOrdered
0,Dorothy,Young,1917 Grand Touring Sedan,2003-01-06,30
1,Dorothy,Young,1911 Ford Town Car,2003-01-06,50
2,Dorothy,Young,1932 Alfa Romeo 8C2300 Spider Sport,2003-01-06,22
3,Dorothy,Young,1936 Mercedes Benz 500k Roadster,2003-01-06,49
4,Roland,Keitel,1932 Model A Ford J-Coupe,2003-01-09,25

## Summary

In this lab, you practiced your knowledge of one-to-many and many-to-many relationships!